#Дана непустая строка S. Вывести строку, содержащую символы строки S, между
#которыми вставлено по одному пробелу.
s = 'Prakticheskaya nomer 7'
a = s
print('a = ', *a)