#Дана строка, содержащая полное имя файла. Выделить из этой строки название
#первого каталога (без символов «\»). Если файл содержится в корневом каталоге, то
#вывести символ «\».

a = ("C:\path\is-23")
print('Вывод:' , a[3:7])


